#language: ru

@tree
@ExportScenarios
@IgnoreOnCIMainBuild

Функционал: Формирование книги ПРОДАЖ с НДС 10 и 20

Как тестировщик я хочу
сформировать книгу продаж
чтобы использовать в дальнейшем в проверке отчетов по НДС

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Я формирую книгу продаж с НДС 10 и 20
* я загружаю документ продажи для формирования книги продажи и провожу документ
	Когда Я загружаю тестовые данные - документ продажи Тест конфета НДС20 и Тест шоколад НДС 10
	И В командном интерфейсе я выбираю 'Продажи' 'Реализация (акты, накладные, УПД)'
	И в таблице "Список" я перехожу к строке:
		| 'Номер'       | 'Контрагент'  |
		| '0000-000010' | 'Кафе Сказка' |
	И я нажимаю на кнопку с именем 'ФормаПровести'
	И я закрываю все окна клиентского приложения
* формирование книги Продаж
	И В командном интерфейсе я выбираю 'Отчеты' 'Книга продаж'
	И я нажимаю на кнопку с именем 'ВыбратьПериод'
	И я нажимаю на кнопку с именем 'ВыбратьКвартал4'
	И из выпадающего списка с именем "ПолеОрганизация" я выбираю точное значение 'Тестовая Организация ООО'
	И я нажимаю на кнопку с именем 'Сформировать'
	И я жду когда в табличном документе 'Результат' заполнится ячейка 'R18C18' в течение 20 секунд
* проверка сформированной книги продаж
	Дано Табличный документ 'Результат' равен макету "КнигаПродажБазовыеНастройки" по шаблону

